In [1]:
#import necessary libraries
import pandas as pd

In [11]:
df_test_scores =pd.DataFrame({'Test1':[95,84,73,88,82,61],'Test2':[74,85,82,73,77,79]},
                              index=['Jack','Lewis','Patrick','Rich','Kelly','Paula'])
df_test_scores

         Test1  Test2
Jack        95     74
Lewis       84     85
Patrick     73     82
Rich        88     73
Kelly       82     77
Paula       61     79

In [3]:
df_test_scores.describe()

           Test1      Test2
count   6.000000   6.000000
mean   80.500000  78.333333
std    11.979149   4.633213
min    61.000000  73.000000
25%    75.250000  74.750000
50%    83.000000  78.000000
75%    87.000000  81.250000
max    95.000000  85.000000

In [5]:
#define function
def standardize_tests(test):
    return (test-test.mean())/test.std()

In [6]:
standardize_tests(df_test_scores['Test1'])

Jack       1.210437
Lewis      0.292174
Patrick   -0.626088
Rich       0.626088
Kelly      0.125218
Paula     -1.627829
Name: Test1, dtype: float64

In [7]:
#define function
def standardize_test_scores(datafrm):
    return datafrm.apply(standardize_tests)

In [10]:
standardize_test_scores(df_test_scores)

            Test1     Test2
Jack     1.210437 -0.935276
Lewis    0.292174  1.438886
Patrick -0.626088  0.791387
Rich     0.626088 -1.151109
Kelly    0.125218 -0.287777
Paula   -1.627829  0.143889